/*****************************************************************************************************************************
******************************************************************************************************************************
マルチスレッドに必要な関数をまとめたヘッダファイル
レーザーレンジファインダのデータ更新や物体検出プログラムのマルチスレッド化のために使用


******************************************************************************************************************************
*****************************************************************************************************************************/
#pragma once

#include <stdio.h>
#include <process.h>
#include <windows.h>

//
//void InitThread(CRITICAL_SECTION *cs, HANDLE *hThread, unsigned __stdcall threadFunc(void *p));
//void EndThread(CRITICAL_SECTION *cs, HANDLE *hThread);